v7idea/chip-pump-cp8000/arduino/hardware/chippump/cp8000/variants/cp8003_sop16/pins_arduino.h
#ifndef ARDUINO_CP8003_SOP16_PINS_ARDUINO_H
#define ARDUINO_CP8003_SOP16_PINS_ARDUINO_H

#include <stdint.h>

#define NUM_DIGITAL_PINS 16
#define NUM_ANALOG_INPUTS 8

#define LED_BUILTIN 0

#define PIN_SERIAL_RX 8
#define PIN_SERIAL_TX 9

static const uint8_t D0 = 0;
static const uint8_t D1 = 1;
static const uint8_t D2 = 2;
static const uint8_t D3 = 3;
static const uint8_t D4 = 4;
static const uint8_t D5 = 5;
static const uint8_t D6 = 6;
static const uint8_t D7 = 7;

#endif
